{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 32, 32], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_32", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_32"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_33", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_32", 0, 0]]], "name": "convolution2d_33"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_34", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_33", 0, 0]]], "name": "convolution2d_34"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["convolution2d_34", 0, 0]]], "name": "dropout_6"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "flatten_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_16", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 384, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 512}, "inbound_nodes": [[["flatten_6", 0, 0]]], "name": "dense_16"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["dense_16", 0, 0]]], "name": "activation_16"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_17", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["activation_16", 0, 0]]], "name": "dense_17"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["dense_17", 0, 0]]], "name": "activation_17"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_18", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3}, "inbound_nodes": [[["activation_17", 0, 0]]], "name": "dense_18"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["dense_18", 0, 0]]], "name": "activation_18"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["convolution2d_32", 0, 0], ["convolution2d_33", 0, 0], ["convolution2d_34", 0, 0], ["activation_18", 0, 0]], "name": "model_1"}}